fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/InformationRegisters/ВКМ_РеализацияДоговор/ВКМ_РеализацияДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_РеализацияДоговор</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("ВКМ_ГруппаАбонентскоеОбслуживание") = Неопределено Тогда
		НоваяГруппаФормы = Элементы.Добавить("ВКМ_ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"));
		НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаФормы.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
		НоваяГруппаФормы.ЦветФона = WebЦвета.БледноЗеленый;
		НоваяГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;		
	КонецЕсли;
	
	Если Элементы.Найти("ВКМ_ГруппаАбонентскоеОбслуживаниеДатаДействияДоговора") = Неопределено Тогда
		НоваяГруппаФормыДатаДействияДоговора = Элементы.Добавить("ВКМ_ГруппаАбонентскоеОбслуживаниеДатаДействияДоговора", Тип("ГруппаФормы"), НоваяГруппаФормы);
		НоваяГруппаФормыДатаДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаФормыДатаДействияДоговора.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		НоваяГруппаФормыДатаДействияДоговора.ОтображатьЗаголовок = Ложь;
		НоваяГруппаФормыДатаДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;		
	КонецЕсли;
	
	Если Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), НоваяГруппаФормыДатаДействияДоговора);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Договор действует с";
	КонецЕсли;
		
	Если Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), НоваяГруппаФормыДатаДействияДоговора);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "по";
	КонецЕсли;
		
	Если Элементы.Найти("ВКМ_АбонентскаяПлата") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), НоваяГруппаФормы);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Ежемесячная абонентская плата";
	КонецЕсли;
		
	Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), НоваяГруппаФормы);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";
	КонецЕсли;

	ВКМ_ВидимостьАбонентскоеОбслуживание();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ДатаНачала = НачалоМесяца(ТекущийОбъект.ВКМ_ДатаНачалаДействияДоговора);
		ДатаОкончания = КонецМесяца(ТекущийОбъект.ВКМ_ДатаОкончанияДействияДоговора);
		
		ДатаДобавления = ДатаНачала;
		
		Пока ДатаДобавления < ДатаОкончания Цикл
			
			НаборЗаписи = РегистрыСведений.ВКМ_РеализацияДоговор.СоздатьНаборЗаписей();
			
			НаборЗаписи.Отбор.Период.Установить(ДатаДобавления);
			НаборЗаписи.Отбор.Договор.Установить(ТекущийОбъект.Ссылка);
			НаборЗаписи.Прочитать();
				
			Если НаборЗаписи.Количество() = 0 Тогда
				
				МенеджерЗаписи = РегистрыСведений.ВКМ_РеализацияДоговор.СоздатьМенеджерЗаписи();
					
				МенеджерЗаписи.Период = ДатаДобавления;
				МенеджерЗаписи.Договор = ТекущийОбъект.Ссылка;
					
				МенеджерЗаписи.Записать();				
					
			КонецЕсли;
			
			ДатаДобавления = ДобавитьМесяц(ДатаДобавления, 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаСервере
Процедура ВКМ_ВидимостьАбонентскоеОбслуживание()
	
	ВидимостьАбонентскоеОбслуживание = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
		
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = ВидимостьАбонентскоеОбслуживание;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = ВидимостьАбонентскоеОбслуживание;
	Элементы.ВКМ_АбонентскаяПлата.Видимость = ВидимостьАбонентскоеОбслуживание;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ВидимостьАбонентскоеОбслуживание;
	
	Если Не ВидимостьАбонентскоеОбслуживание Тогда
		
		Объект.ВКМ_ДатаНачалаДействияДоговора = Неопределено;
		Объект.ВКМ_ДатаОкончанияДействияДоговора = Неопределено;
		Объект.ВКМ_АбонентскаяПлата = Неопределено;
		Объект.ВКМ_СтоимостьЧасаРаботы = Неопределено;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОБработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	ВКМ_ВидимостьАбонентскоеОбслуживание();	

КонецПроцедуры

#КонецОбласти
